cases/ansys_verification/VMFL010/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType laminar;   // manual p.39: laminar flow
// ************************************************************************* //
