cases/ansys_verification/VMFL010/case/0/p
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [ 0 2 -2 0 0 0 0 ];   // kinematic pressure (incompressible)
internalField   uniform 0;
boundaryField
{
    inlet        { type zeroGradient; }
    mainOutlet   { type fixedValue; value uniform 0; }   // equal static pressure
    branchOutlet { type fixedValue; value uniform 0; }   // equal static pressure
    walls        { type zeroGradient; }
    frontBack    { type empty; }
}
// ************************************************************************* //
