cases/ansys_verification/VMFL010/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-9; relTol 0.01; }
    U { solver smoothSolver; smoother GaussSeidel; tolerance 1e-9; relTol 0.1; }
}
SIMPLE { nNonOrthogonalCorrectors 2; consistent yes;
         residualControl { p 1e-7; U 1e-7; } }
relaxationFactors { equations { U 0.9; p 0.9; } }
// ************************************************************************* //
